src/main/java/br/com/infotera/it/tboholiday/newXMLDocument.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Credentials xmlns="http://TekTravel/HotelBookingApi" UserName="InfoteraTest" Password="Inf@64890970"/>
    </soap:Header>
    <soap:Body>
        <HotelBookRequest xmlns="http://TekTravel/HotelBookingApi">
            <ClientReferenceNumber>230420145207000#TBOH</ClientReferenceNumber>
            <GuestNationality>BR</GuestNationality>
            <Guests>
                <Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>NIVALDO</FirstName>
                    <LastName>MAIA</LastName>
                    <Age>40</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Adult" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>LEONETE</FirstName>
                    <LastName>MEDEIROS</LastName>
                    <Age>40</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Adult" GuestInRoom="2">
                    <Title>MR</Title>
                    <FirstName>DOMINGOS</FirstName>
                    <LastName>BARRETO</LastName>
                    <Age>40</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Adult" GuestInRoom="2">
                    <Title>MR</Title>
                    <FirstName>MAGALI</FirstName>
                    <LastName>FREITAS</LastName>
                    <Age>40</Age>
                </Guest>
            </Guests>
            <PaymentInfo VoucherBooking="true" PaymentModeType="Limit"/>
            <SessionId>9a0d9020-c522-4e7b-ace9-a88e824c5603</SessionId>
            <NoOfRooms>2</NoOfRooms>
            <ResultIndex>1</ResultIndex>
            <HotelCode>1246485</HotelCode>
            <HotelName>Hotel Joamar</HotelName>
            <HotelRooms>
                <HotelRoom>
                    <RoomIndex>1</RoomIndex>
                    <RoomTypeName>Standard Twin Room,2 Twin Beds,Nonsmoking</RoomTypeName>
                    <RoomTypeCode>2x Standard Twin Room,2 Twin Beds,Nonsmoking</RoomTypeCode>
                    <RoomRate RoomFare="49.35" RoomTax="2.46" TotalFare="51.81"/>
                </HotelRoom>
                <HotelRoom>
                    <RoomIndex>2</RoomIndex>
                    <RoomTypeName>Standard Twin Room,2 Twin Beds,Nonsmoking</RoomTypeName>
                    <RoomTypeCode>2x Standard Twin Room,2 Twin Beds,Nonsmoking</RoomTypeCode>
                    <RoomRate RoomFare="49.35" RoomTax="2.46" TotalFare="51.81"/>
                </HotelRoom>
            </HotelRooms>
            <RestrictDuplicateBooking>true</RestrictDuplicateBooking>
        </HotelBookRequest>
    </soap:Body>
</soap:Envelope>
